In [1]:
#!pip install pymysql
#!pip install sqlalchemy

#enter in mac terminal
#these libraries allow python to connect to sql database

In [2]:
import pandas as pd
import numpy as np

import pymysql #for getting data from a sql database
from sqlalchemy import create_engine #for establishing the connection and authentication

from getpass import getpass  # To get the password without showing the input

In [3]:
password = getpass() #print(password)

········

In [10]:
connection_string = 'mysql+pymysql://root:'+password+'@localhost/bank'
engine = create_engine(connection_string) #127.0.0.1

In [ ]:
# 1. How many distinct (different) actors' last names are there?

In [32]:
query_1 = 'SELECT COUNT(DISTINCT last_name) AS "num_diff_actors" FROM sakila.actor;'
print(query)

SELECT *, CASE WHEN weekday(rental_date) = 5 OR weekday(rental_date) = 6 THEN "weekend" ELSE "workday" END AS "day_type" FROM sakila.rental;

In [33]:
data_1 = pd.read_sql_query(query_1, engine)
data_1.head()

   num_diff_actors
0              121

In [34]:
# 2. Add an additional column day_type with values 'weekend' and 'workday' depending on the rental day of the week.

In [35]:
query_2 = 'SELECT *, \
CASE WHEN weekday(rental_date) = 5 OR weekday(rental_date) = 6 THEN "weekend" ELSE "workday" END AS "day_type" FROM sakila.rental;'

In [36]:
data_2 = pd.read_sql_query(query_2, engine)
data_2.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update,day_type
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53,workday
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53,workday
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53,workday
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53,workday
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53,workday

In [37]:
# 3. Get all films with ARMAGEDDON in the title.

In [44]:
query_3 = 'SELECT * FROM sakila.film WHERE title LIKE "%%ARMAGEDDON%%";'

In [45]:
data_3 = pd.read_sql_query(query_3, engine)
data_3.head()

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,39,ARMAGEDDON LOST,A Fast-Paced Tale of a Boat And a Teacher who ...,2006,1,None,5,0.99,99,10.99,G,Trailers,2006-02-15 05:03:42
1,507,LADYBUGS ARMAGEDDON,A Fateful Reflection of a Dog And a Mad Scient...,2006,1,None,4,0.99,113,13.99,NC-17,Deleted Scenes,2006-02-15 05:03:42
2,571,METAL ARMAGEDDON,A Thrilling Display of a Lumberjack And a Croc...,2006,1,None,6,2.99,161,26.99,PG-13,"Trailers,Commentaries,Deleted Scenes",2006-02-15 05:03:42
3,598,MOSQUITO ARMAGEDDON,A Thoughtful Character Study of a Waitress And...,2006,1,None,6,0.99,57,22.99,G,Trailers,2006-02-15 05:03:42
4,838,STAGECOACH ARMAGEDDON,A Touching Display of a Pioneer And a Butler w...,2006,1,None,5,4.99,112,25.99,R,"Trailers,Deleted Scenes",2006-02-15 05:03:42

In [46]:
# 4. Get 10 the longest films.

In [47]:
query_4 = 'SELECT * FROM sakila.film ORDER BY length DESC LIMIT 10;'

In [48]:
data_4 = pd.read_sql_query(query_4, engine)
data_4.head()

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,349,GANGS PRIDE,A Taut Character Study of a Woman And a A Shar...,2006,1,None,4,2.99,185,27.99,PG-13,Behind the Scenes,2006-02-15 05:03:42
1,872,SWEET BROTHERHOOD,A Unbelieveable Epistle of a Sumo Wrestler And...,2006,1,None,3,2.99,185,27.99,R,Deleted Scenes,2006-02-15 05:03:42
2,609,MUSCLE BRIGHT,A Stunning Panorama of a Sumo Wrestler And a H...,2006,1,None,7,2.99,185,23.99,G,Deleted Scenes,2006-02-15 05:03:42
3,817,SOLDIERS EVOLUTION,A Lacklusture Panorama of a A Shark And a Pion...,2006,1,None,7,4.99,185,27.99,R,"Trailers,Commentaries,Deleted Scenes,Behind th...",2006-02-15 05:03:42
4,690,POND SEATTLE,A Stunning Drama of a Teacher And a Boat who m...,2006,1,None,7,2.99,185,25.99,PG-13,"Trailers,Commentaries,Behind the Scenes",2006-02-15 05:03:42

In [49]:
# 5. How many films include Behind the Scenes content?

In [52]:
query_5 = 'SELECT COUNT(*) AS "films_BHC" FROM sakila.film WHERE special_features like "Behind the Scenes";'

In [53]:
data_5 = pd.read_sql_query(query_5, engine)
data_5.head()

   films_BHC
0         70

In [46]:
# 6. Which kind of movies (rating) have a mean duration of more than two hours?

In [54]:
query_6 = 'SELECT rating, ROUND(AVG(length),2) AS avg_length FROM sakila.film GROUP BY rating HAVING AVG(length) > 120;'

In [55]:
data_6 = pd.read_sql_query(query_6, engine)
data_6.head()

  rating  avg_length
0  PG-13      120.44

In [46]:
# 7. Rank films by length (filter out the rows that have nulls or 0s in length column). In your output, only select the columns title, length, and the rank.

In [56]:
query_7 = 'SELECT title, length, rating FROM sakila.film WHERE length != 0 AND length IS NOT NULL ORDER BY length DESC;'

In [57]:
data_7 = pd.read_sql_query(query_7, engine)
data_7.head()

            title  length rating
0   CHICAGO NORTH     185  PG-13
1  CONTROL ANTHEM     185      G
2  DARN FORRESTER     185      G
3     GANGS PRIDE     185  PG-13
4       HOME PITY     185      R

In [58]:
# END OF LAB